import { ref, computed } from 'vue'
import { defineStore } from 'pinia'
export interface Song {
  id: number
  name: string
  singers: string
  isLove: boolean
  time: string
  path: string
  list: Array<number>
  video?: string
  lyric?: string
}
export interface SongList {
  id: number
  name: string
  description: string
}
export const useSongStore = defineStore(
  'song',
  () => {
    const songList = ref<Array<SongList>>([])
    const SongDefaultList = ref<Array<Song>>([
      {
        id: 1,
        name: 'payphone',
        singers: 'Maroon 5、Wiz Khalifa',
        isLove: false,
        time: '03:51',
        path: '/music/payphone.wav',
        list: [],
        lyric: `[00:00.00]Payphone - Maroon 5/Wiz Khalifa
[00:00.11]Lyrics by：Adam Levine/Benny Blanco/Ammar Malik/Robopop
[00:00.31]Composed by：Shellback/Benny Blanco
[00:00.42]Produced by：Benny Blanco/Shellback/Robopop
[00:00.56]Adam Levine：
[00:00.60]I'm at a payphone trying to call home
[00:04.73]All of my change I spent on you
[00:09.21]Where have the times gone
[00:11.29]Baby it's all wrong
[00:13.58]Where are the plans we made for two
[00:18.37]Yeah I I know it's hard to remember
[00:21.57]The people we used to be
[00:23.72]It's even harder to picture
[00:25.96]That you're not here next to me
[00:28.06]You say it's too late to make it
[00:30.28]But is it too late to try
[00:32.37]And in our time that you wasted
[00:34.51]All of our bridges burned down
[00:37.17]I've wasted my nights
[00:39.11]You turned out the lights
[00:41.31]Now I'm paralyzed
[00:43.74]Still stuck in that time
[00:45.71]When we called it "Love"
[00:47.87]But even the sun
[00:50.06]Sets in paradise
[00:53.01]I'm at a payphone trying to call home
[00:57.15]All of my change I spent on you
[01:01.51]Where have the times gone
[01:03.67]Baby it's all wrong
[01:05.87]Where are the plans we made for two
[01:10.15]If happy-ever-after's did exist
[01:14.55]I would still be holding you like this
[01:18.96]All those fairytales are full of ****
[01:23.27]One more ******* love song I'll be sick oh
[01:29.15]You turned your back on tomorrow
[01:31.36]'Cause you forgot yesterday
[01:33.49]I gave you my love to borrow
[01:35.71]But you just gave it away
[01:38.05]You can't expect me to be fine
[01:40.15]I don't expect you to care
[01:42.36]I know I said it before
[01:43.75]But all of our bridges burned down
[01:46.93]I've wasted my nights
[01:48.99]You turned out the lights
[01:51.13]Now I'm paralyzed
[01:53.53]Still stuck in that time
[01:55.58]When we called it "Love"
[01:57.69]But even the sun
[01:59.91]Sets in paradise
[02:02.73]I'm at a payphone trying to call home
[02:06.94]All of my change I spent on you
[02:10.45]Whoa whoa-oa
[02:11.46]Where have the times gone
[02:13.50]Baby it's all wrong
[02:15.63]Where are the plans we made for two
[02:19.31]Yeah
[02:19.49]Adam Levine/Wiz Khalifa：
[02:20.10]If happy-ever-after's did exist
[02:24.32]I would still be holding you like this
[02:28.71]And all those fairytales are full of ****
[02:33.08]One more ******* love song I'll be sick
[02:36.98]Uh
[02:37.58]Now I'm at a payphone
[02:38.85]Wiz Khalifa：
[02:39.42]Man **** that ****
[02:40.69]I'll be out spending all this money while you're sitting 'round
[02:42.88]Wondering why it wasn't you who came up from nothin'
[02:45.06]Made it from the bottom now when you see me I'm stuntin'
[02:47.30]And all of my cars start with the push of a button
[02:49.45]Telling me I changed since I blew up or whatever you call it
[02:51.87]Switched the number to my phone so you never could call it
[02:54.00]Don't need my name on my shirt you can tell that I'm ballin'
[02:56.29]Swish what a shame coulda got picked
[02:58.46]Had a really good game but you missed your last shot
[03:00.58]So you talk about who you see at the top
[03:02.59]Or what you could've saw but sad to say it's over for
[03:04.98]Phantom pulled up valet open doors
[03:07.22]Wished I'd go away got what you was looking for
[03:09.31]Now it's me who they want
[03:10.50]So you can go take that little piece of **** with you
[03:12.39]Adam Levine：
[03:12.66]I'm at a payphone trying to call home
[03:16.77]All of my change I spent on you
[03:20.99]Whoo
[03:21.22]Where have the times gone
[03:23.32]Baby it's all wrong
[03:25.52]Where are the plans we made for two
[03:28.84]For two
[03:29.40]Yeah
[03:29.58]If happy-ever-after's did exist
[03:34.20]I would still be holding you like this
[03:38.33]And all these fairytales are full of ****
[03:42.94]One more ******* love song I'll be sick
[03:47.11]Now I'm at a payphone
[03:49.94]`,
      },
      {
        id: 2,
        name: '♥︎らぶ★ちゅき!!',
        singers: '佐倉紗織',
        isLove: false,
        time: '01:50',
        path: '/music/AnimalPanic.wav',
        list: [],
        video: '/movie/AnimalPanic.mp4',
        lyric: `[00:01.00]♥︎らぶ★ちゅき!!
[00:02.50]歌手 - 佐倉紗織 -
[00:04.00]            
[00:06.50]啊尼☆啪尼 呜尼☆呜尼
[00:09.00]爱☆喜爱 亲爱的☆亲爱的
[00:12.50]LALALALALOVE！！ 在恋爱的魔力下
[00:15.20]我能变得更加可爱
[00:17.90]女孩总是这样
[00:21.00]羞涩地等待！心跳的瞬间☆
[00:24.00]NANANANA什么！？ 耳畔的轻声呢喃♡
[00:26.80]能让我听见你的声音吗？
[00:29.80]秘密中的我们已陷入一片慌乱～！！
[00:34.00]love☆suki love☆suki
[00:36.80]用魔法般的言语♡
[00:40.00]改变了那不变的每一天
[00:45.00]耀眼的光芒 命运的邂逅
[00:51.80]恋爱的碎片 梦的轮廓
[00:58.00]宝石啊 请让我的愿望成真！！
[01:02.90]LALALALALOVE！！ 我充满期待
[01:06.00]更想与你亲近
[01:09.00]女孩总是这样
[01:12.00]微笑着 紧紧地！抱住你☆
[01:14.80]NANANANA什么！？ 耳朵可不能这样哦♡
[01:18.00]听着那呢喃…让我全身都颤抖！
[0:20.80]我们这疯狂的二人 已经陷入了慌乱～！！
[01:25.00]love☆suki love☆suki
[01:27.90]魔法永不消失♡
[01:31.00]          `,
      },
      {
        id: 3,
        name: 'ラブピカルポッピー！',
        singers: '未知',
        isLove: false,
        time: '01:29',
        path: '/music/smee.wav',
        list: [],
        video: '/movie/smee.mp4',
        lyric: `[00:00.10]ラブピカルポッピー!
[00:01.00]     
[00:03.00]哎呀呀这突然的心跳
[00:04.50]哦呦呦感觉越陷越深了
[00:07.00]          
[00:09.00]稍微感觉有点困了
[00:10.20]就被突然对上的眼神吓到了
[00:12.60]          
[00:15.00]纠结要不要去学习的日常
[00:17.50]不管啦先去玩一会吧
[00:20.20]啊哈?
[00:21.30]纠结要不要去运动的日常
[00:23.80]开摆啦事已至此先睡觉吧
[00:26.10]啊哈?
[00:27.00]叮叮咚咚 恭喜优胜
[00:29.00]是你压倒性的
[00:30.00]不可思议的大胜利啊 耶耶
[00:33.00]叮叮咚咚 节日快乐
[00:35.00]现在就快点来庆祝节日
[00:36.90]嘚嘚嘚嘚嘚嘚♪
[00:38.30]芜湖~
[00:39.00]把无聊的事情
[00:40.00]全部都丢掉吧
[00:41.50]很快就会明白的 热闹的节日~
[00:44.50]无论是南边 北边 东边 还是西边
[00:47.80]乐园已经近在眼前啦
[00:50.00]噼里啪啦的派对时间已经开始啦
[00:51.90]大家一起欢跃吧
[00:53.80]你是最棒的 万万岁!
[00:56.30]从始至终你都是这么闪耀
[00:59.20]简直就是我的推中之推
[01:01.80]再让派对更加热烈一点吧
[01:03.50]大家一起来石头剪刀布
[01:05.00]是我赢了 万万岁!
[01:08.00]一直以来都能这样下去就是万万岁!
[01:11.00]自由自在
[01:13.00]明天吃什么好呢?
[01:14.50]      `,
      },
      {
        id: 4,
        name: '鏖呪ノ嶼',
        singers: '未知',
        isLove: false,
        time: '02:15',
        path: '/music/clock1.wav',
        list: [],
        video: '/movie/clock1.mp4',
      },
      {
        id: 5,
        name: 'Liar,Liar',
        singers: 'Mr.FanTastic',
        isLove: false,
        time: '03:07',
        path: '/music/clock2.flac',
        list: [],
        video: '/movie/clock2.mp4',
        lyric: `[00:00.00] 作曲 : Mr.FanTastiC
[00:01.00] 作词 : メガテラ・ゼロ
[00:18.13] always
[00:20.37] I was thinking only of you
[00:22.30] I was thinking only of you
[00:24.57] Everyday.
[00:25.28] Everyday.
[00:26.53] Only the day-to-day it
[00:28.74] でもあなた　終わらせた
[00:31.02] 積み重ねた　今まで
[00:33.10] 一言で　ねじ伏せた
[00:35.23] 「明日から他人事」
[00:37.00] Bye bye.Good bye.
[00:38.93] It I will be a healthy
[00:40.33] 止めないで
[00:41.94] ねぇ言ったじゃん？
[00:44.06] 永遠に続く恋をしようって
[00:48.47] 終わらない
[00:49.96] 愛を誓ってた
[00:52.37] あの日の言葉は？
[00:54.34] ねぇベイビー？ライヤー？
[00:56.49] ライヤー・ライヤー
[01:06.03] always
[01:07.15] I was thinking only of you
[01:09.27] I was thinking only of you
[01:11.30] Everyday.
[01:12.43] Everyday.
[01:13.34] Only the day-to-day it
[01:15.76] でも、もう終わってしまった
[01:17.14] 戻ったってつぎはぎだらけで
[01:18.26] きっと目を合わせることすら
[01:19.40] 難しくなっているんだ
[01:20.17] 今頃あいつは次のドールを見つけてしまっていて
[01:21.81] アイム a ファッキュー
[01:22.59] 変わらないで
[01:24.58] ねぇ言ったじゃん？
[01:26.69] 変わることなく好きでいようって
[01:31.12] 形ない
[01:32.48] 口約束
[01:35.09] 簡単に終わるのね
[01:37.37] ヘイベイビー？ライヤー？
[01:39.15] ライヤー・ライヤー
[01:41.25] I won't forgive you, you liar！
[02:11.58] 変わらないで
[02:13.67] ねぇ言ったじゃん？
[02:15.76] 変わることなく好きでいようって
[02:20.26] 形ない
[02:21.56] 口約束
[02:24.23] 簡単に終わるのね
[02:26.32] ヘイベイビー？
[02:28.62] 止めないで
[02:31.44] ねぇ
[02:32.90] 永遠に続く恋をしようって
[02:37.41] 終わらない
[02:38.52] 愛を誓ってた
[02:41.24] あの日の言葉は？
[02:43.27] ねぇベイビー？ライヤー？
[02:45.43] ライヤー・ライヤー
[02:47.39] 言ったじゃん？
[02:49.88] 永遠に続く恋をしようって
[02:54.56] ねぇ？
[03:01.70] ライヤー・ライヤー
[04:01.70]     `,
      },
      {
        id: 6,
        name: '失眠的羊与孤独的狼',
        singers: '未知',
        isLove: false,
        time: '02:04',
        path: '/music/clock3.wav',
        list: [],
        video: '/movie/clock3.mp4',
      },
      {
        id: 7,
        name: '非実在青少年',
        singers: 'いとうかなこ',
        isLove: false,
        time: '04:03',
        path: '/music/chaosChild.flac',
        list: [],
        video: '/movie/chaosChild.mp4',
        lyric: `[00:00.00]非実在青少年 - いとうかなこ (伊藤加奈子)
[00:00.52]词：志倉千代丸
[00:01.04]曲：志倉千代丸
[00:01.56]不可思议的 妄想
[00:05.93]前往淫靡的世界
[00:10.61]渐渐被 无痛细胞 吞噬殆尽
[00:34.71]忘我奔上螺旋阶梯
[00:41.77]被追赶
[00:45.10]去追赶
[00:48.05]和我一起掉落 无论到何方
[00:54.13]你打算怎么做？
[01:01.68]唯有指示器
[01:04.46]盲目的忽明忽灭 白昼狂气
[01:12.24]欢迎来到混沌世界────
[01:17.32]不可思议的 妄想
[01:20.71]前往淫靡的世界
[01:24.12]渐渐被 无痛细胞 吞噬殆尽
[01:31.20]我们眼里所见的世界是
[01:37.93]实在与谎言的境界
[01:45.33]闭上眼睛浮现而出的是
[01:48.56]消极的同化
[01:51.87]被封锁的噪音
[01:55.33]即将开始呐喊
[01:57.99]和我一起掉落 闭上双眼
[02:04.36]你打算怎么做？
[02:08.31]只要用心感受
[02:12.28]背叛的天空 染上赤红的色彩
[02:17.69]恶意全能
[02:21.47]欢迎来到混沌世界────
[02:27.48]自由的妄想是
[02:30.82]加速的快感
[02:34.43]蔓延的感染 渐渐化作愉悦
[02:41.44]我们眼里所见的世界是
[02:48.46]实在与谎言的境界
[03:10.50]不可思议的 妄想
[03:13.59]前往淫靡的世界
[03:17.00]渐渐被 无痛细胞 吞噬殆尽
[03:24.34]我们眼里所见的世界是
[03:31.21]实在与谎言的境界
[03:36.25]              `,
      },
      {
        id: 8,
        name: '桃花染に咲いて',
        singers: '中恵光城',
        isLove: false,
        time: '05:29',
        path: '/music/sakura.flac',
        list: [],
      },
      {
        id: 9,
        name: 'breaking light',
        singers: '佐藤アスカ',
        isLove: false,
        time: '04:01',
        path: '/music/breaking light.mp3',
        list: [],
        video: '/public/movie/breaking light.mp4',
        lyric: `[00:00.00]
[00:00.64]集合了开场午夜派对
[00:04.94]撕破黑暗奏一曲音乐
[00:08.32]在不见尽头的狂欢中
[00:12.08]偷走人们的心跳和叹息
[00:30.48]窃取你的芳心 让你不禁屏息
[00:34.13]无法得到满足的欲望 于内心深处蠢蠢欲动
[00:41.34]男女老少都在寻求 将无聊一扫而空的娱乐
[00:48.63]于深夜的暗影中亮起一盏明灯
[00:55.91]将涌上心头的感情也一并盗走
[01:05.15]穿梭潜行 在无光的世界
[01:08.69]偷梁换柱 仅需眨眼瞬间
[01:12.31]窃取目标 紧紧攥在手心
[01:15.94]彼此心意 也于瞬间相拥
[01:21.04]直到长夜破晓时
[01:41.53]对所有人伏下的谎言 悄悄潜藏尽日常
[01:48.76]非现实即为黑暗 进而将一切解放
[01:56.03]夜幕的背面 还剩少许余温
[02:03.22]攀上微颤的心 连着也一并夺走
[02:12.35]尽情舞蹈 在暗夜之中
[02:15.97]轻轻滑出 这孤高的舞步
[02:19.74]无聊理论 通通抛在脑后
[02:23.23]四目相对 在你察觉瞬间
[02:28.32]融入夜色后消失
[02:46.61]回荡不绝的音节 嗨起来的绝佳节奏
[02:50.03]各怀心愿的人们 彼此视线交错
[02:54.21]跟上这BPM  让内心更加躁动
[02:57.63]层层叠加的谎言 涂抹出更加浓郁的黑暗
[03:06.93]穿梭潜行 在无光的世界
[03:10.49]偷梁换柱 仅需眨眼瞬间
[03:14.14]窃取目标 紧紧攥在手心
[03:17.79]彼此心意 也与此刻相通
[03:21.28]尽情舞蹈 在暗夜之中
[03:25.07]轻轻滑出 这孤高的舞步
[03:28.79]无聊理论 通通抛在脑后
[03:32.24]四目相对 眼线交汇瞬间
[03:37.46]直到长夜破晓时
[03:39.83]`,
      },
      {
        id: 10,
        name: '魔法飞天',
        singers: '未知',
        isLove: false,
        time: '01:37',
        path: '/music/fly.wav',
        list: [],
        video: '/movie/fly.mp4',
      },
      {
        id: 11,
        name: 'leap in your mind',
        singers: '霜月はるか',
        isLove: false,
        time: '04:53',
        path: '/music/leap in your mind.mp3',
        list: [],
        video: '/movie/leap in your mind.mp4',
        lyric: `[00:00.00]
[00:01.47] leap in your mind
[00:01.69] 霜月はるか (霜月遥)
[00:01.95]
[00:28.32]空论飞散零落
[00:29.93]赤红的绝望
[00:31.97]浸染视野
[00:37.31]混沌蠕动伏行
[00:39.14]死寂深邃的
[00:41.25]黑暗噪音
[00:45.69]已经
[00:46.21]无处可去
[00:48.51]从最初起就没有归宿
[00:50.19]一定
[00:50.74]即便如此
[00:53.16]仍要寻觅那唯一的真实
[00:55.36]紧握于手心的真实
[00:57.69]倘若有人
[00:58.18]称之为「爱」
[00:59.90]如今那份「爱」
[01:01.52]会将我们的世界
[01:02.43]毁灭殆尽
[01:04.01]沁人心脾的温暖
[01:09.02]
[01:09.32]支离破碎
[01:11.60]透明的感情
[01:13.26]飘忽不定的指尖
[01:18.08]谋求在那前方的答案
[01:22.36]从远方听到的
[01:31.38]似有似无的耳鸣
[01:40.61]无法遏止的恸哭
[01:49.73]照亮了依旧黯淡的未来
[02:01.81]
[02:18.00]骚乱始动
[02:19.74]漆黑的欲望
[02:21.82]停滞了世界
[02:26.89]终焉降临的夜晚
[02:29.03]谁来救救我
[02:30.95]只是一味祈祷
[02:35.33]没错 答案与归宿
[02:37.80]全部
[02:38.30]从最初起便已全部命中注定
[02:40.58]即便如此 那其实也是「谎言」
[02:42.80] 除了唯一的爱情
[02:45.08]紧握于手心的爱情
[02:47.49]倘若令我唤其「姓名」
[02:49.69]或许那份爱
[02:51.25]会令我们的未来
[02:52.21]四分五裂
[02:53.76]映于眼中的是
[02:59.13]那天所见之景的
[03:01.36]虚幻断片
[03:03.01]浪潮渐渐拭去
[03:07.96]传达不到的声音
[03:12.07]跨越时间前行吧
[03:21.04]迈向孤独的螺旋
[03:30.17]无法愈合的伤口
[03:39.38]连接着依旧黯淡的未来
[04:07.03]自远方响起阵阵
[04:15.88]似有似无的耳鸣
[04:25.10]无法遏止的恸哭
[04:34.19]照亮了依旧黯淡的未来
[04:46.39]    `,
      },
      {
        id: 12,
        name: 'Justy×Nasty',
        singers: '未知',
        isLove: false,
        time: '01:45',
        path: '/music/Justy×Nasty.wav',
        list: [],
        video: '/movie/Justy×Nasty.mp4',
      },
      {
        id: 13,
        name: 'ものべののうた',
        singers: '西沢はぐみ',
        isLove: false,
        time: '04:53',
        path: '/music/lose.mp3',
        list: [],
        lyric: `[00:00.00]
[00:20.51]物 物 物部的 的 的 郊外
[00:27.88]明 明 明天也请多多关照哦
[00:35.32]我听到了哦 耳畔清晰而明亮的声音
[00:43.20]是谁在呼唤着我
[00:50.22]即使是误入森林
[00:54.00]黑夜中不知归路
[00:58.13]就算是一个人也没有什么好怕的
[01:06.96]物部的的歌谣
[01:10.97]响彻云霄
[01:14.36]一起哼唱这首歌谣的话
[01:18.39]欢乐便会满溢而出哦
[01:21.87]物部的的歌谣 萦绕梦乡
[01:29.27]无论何时与你相约到永久
[01:33.23]你们 都是我的至爱
[01:55.33]物 物 物部的 的 的 农家
[02:02.74]神 神 神明一直以来多谢关照
[02:10.27]我听到了哦
[02:13.41]您会一直
[02:18.09]守护着我们
[02:25.17]即使是误入深山
[02:28.82]飞瀑下不知归路
[02:32.99]你也不会是孤身一人
[02:41.87]物部的的歌谣
[02:45.90]漫舞沧海
[02:49.30]尽情高歌一曲的话
[02:53.30]欢乐便会纷飞飘零哦
[02:56.78]物部的的歌谣
[03:00.70]穿越时空
[03:04.17]无论何时与你相约到永久
[03:08.08]幸福携手相伴太好了
[03:15.30]如果感到寂寞的话
[03:22.79]会一直陪在你的身边
[03:45.15]物部的的歌谣 响彻云霄
[03:52.52]一起哼唱这个歌谣的话
[03:56.52]欢乐便会满溢而出
[04:00.08]物部的的歌谣 萦绕梦乡
[04:07.44]无论何时与你相约到永久
[04:11.34]你们 都是我的至爱
[04:14.81]`,
      },
      {
        id: 14,
        name: 'Love♡Vacation',
        singers: '松下、nayuta',
        isLove: false,
        time: '04:03',
        path: '/music/Love♡Vacation.mp3',
        list: [],
        video: '/movie/Love♡Vacation.mp4',
      },
      {
        id: 15,
        name: '神様の神様',
        singers: 'ハナエ',
        isLove: false,
        time: '03:36',
        path: '/music/god.flac',
        list: [],
        lyric: `[00:00.00]
[00:00.30]神様の神様 - ハナエ (Hanae)
[00:03.46]词：Shuichi Mabe
[00:04.02]曲：Shuichi Mabe
[00:13.65]究竟
[00:15.20]这世界是怎么一回事？
[00:20.17]我飞过这片天空
[00:22.87]绕着地球一圈圈
[00:26.52]星期一二三四五六日
[00:29.57]周而复始的生物钟
[00:33.11]如全自动的洗衣机般
[00:37.55]没错
[00:37.98]我绕着这世界旋转不停
[00:44.62]喜欢无止境
[00:48.84]无止境
[00:51.63]绕着这世界旋转不停
[00:57.77]时而急躁的爱恋
[01:01.41]想要传达给你
[01:05.60]如果有人问我
[01:06.85]最近怎么样？
[01:08.72]我很好 谢谢
[01:09.93]肯定会这样回答的吧
[01:11.89]猛然变得自负的我
[01:13.54]请悄悄
[01:15.18]来我身边责骂吧
[01:18.49]爱上的那刻起 我便是神明
[01:37.96]其实
[01:39.57]诚如你所说
[01:42.72]一步登天
[01:44.40]然历史依旧反复上演
[01:47.36]初始与终结
[01:49.36]真不可思议
[01:50.95]风花雪月 四季之景
[01:53.86]辗转轮回的季节
[01:57.43]无所不知无所不能 全部掌握在手心
[02:02.29]我绕着这世界旋转不停
[02:08.97]随心所欲也没关系的吧
[02:11.46]也没关系的吧
[02:15.30]若没有想要的东西
[02:17.98]想要的东西
[02:22.00]不就毫无意义了吗
[02:24.42]毫无意义了吗
[02:41.43]我绕着这世界旋转不停
[02:47.98]喜欢无止境
[02:50.35]无止境
[02:54.83]绕着这世界旋转不停
[03:00.99]时而急躁的爱恋
[03:04.80]想要传达给你
[03:08.77]却总是
[03:09.50]却总是无处传达
[03:12.04]世间也有那般的爱情吧
[03:15.15]剪不清
[03:15.99]剪不清理还乱
[03:17.08]解不开的爱
[03:19.15]总能召唤奇迹
[03:21.72]神啊我好像是
[03:24.86]属于你的神呢
[03:29.92]`,
      },
      {
        id: 16,
        name: '睡乱的头发',
        singers: '洲崎綾',
        isLove: false,
        time: '03:54',
        path: '/music/sleep.flac',
        list: [],
      },
      {
        id: 17,
        name: '太阳乐园',
        singers: 'nao',
        isLove: false,
        time: '04:35',
        path: '/music/sun.flac',
        list: [],
        video: '/movie/sun.mp4',
        lyric: `[00:00.00]タイヨウパラダイス (『ネコぱら』OP) - nao (なお)
[00:00.17]词：雪仁
[00:00.34]曲：水城新人
[00:00.51]我们的思念满溢
[00:07.05]奏响温柔的旋律
[00:12.71]
[00:26.73]被甜蜜的红茶诱惑
[00:31.96]温柔的阳光
[00:34.87]渗入玛奇朵咖啡中
[00:39.84]如同甜甜的蛋糕一般
[00:41.97]在斑驳的阳光下
[00:45.00]喝一口上等的滴落式咖啡
[00:47.96]品尝隐藏其中的味道
[00:52.47]当任性的风儿叩响门扉
[00:58.71]伸出双手看看吧
[01:01.64]我们的太阳正在歌唱
[01:07.74]在流星划过的蓝天的彼方
[01:13.68]只是在这个瞬间
[01:16.34]想要与你相互凝视
[01:20.06]在未来的预想图上
[01:22.01]现在就在这里 向着太阳
[01:26.59]不断前行在描绘出的广阔道路上
[01:33.58]我们的思念满溢
[01:40.10]奏响温柔的旋律
[01:59.89]在内心深处浮现的拿铁咖啡
[02:04.95]即使现在也无法忘记温暖的内心
[02:12.52]无论多少次 每当钟声响起
[02:18.77]太阳都将被我们的笑容填满
[02:27.00]微笑吧
[02:27.73]全新的天空之色映照在内心之中
[02:33.69]无论何时
[02:34.82]都希望可以一直见证这样的奇迹
[02:40.03]对于未来的预想图
[02:42.47]无论是怎样宏伟的梦想
[02:46.54]也没有将它填满
[02:49.50]在耀眼的阳光中
[03:06.33]Ah
[03:07.46]就这样在浅眠中轻轻晃动
[03:12.67]听到了温柔的呼唤声
[03:15.46]就这样让我们紧紧相拥
[03:20.87]抬头仰望 细数天空中的流星
[03:24.85]幸福的奇迹就是
[03:27.30]可以在天空中自由飞翔
[03:30.21]这是你告诉我的哦
[03:33.93]在未来的预想图上
[03:35.94]描绘出了巨大的彩虹
[03:40.42]现在就要经过这里 到达太阳之上
[03:46.99]
[03:47.40]我们的思念满溢
[03:53.91]奏响温柔的旋律
[04:00.45]我们所描绘的太阳
[04:07.01]无论何时 都在这片天空中熠熠生辉
[04:11.87]        `,
      },
      {
        id: 18,
        name: 'magic drive!',
        singers: '大島はるな',
        isLove: false,
        time: '03:59',
        path: '/music/magic drive!.mp3',
        list: [],
        video: '/movie/magic drive!.mp4',
        lyric: `[00:00.00]ゲーム「初情スプリンクル」主題歌
[00:00.16] singer:大島はるな
[00:00.93]
[00:16.43]那个这个
[00:17.63]什么都
[00:19.22]想触碰描摹 拥有至深的爱
[00:21.95]每天都过得很愉快
[00:27.16]不知不觉间 不知为何出现大危机
[00:29.86]在恐慌的绝境中
[00:32.63]发生了不可思议的奇迹
[00:35.44]不停地旋转
[00:39.75]让我们把握它 传达思念
[00:45.03]可以看出我们正在靠近
[00:47.84]即将开始两个人的故事
[00:50.61]今后更加
[00:52.80]闪耀光芒 喂
[00:55.73]初次的悸动
[00:58.29]用绽放爱情的魔法 让爱在心中萌芽
[01:01.80]心跳更加厉害
[01:06.38]在夜空中亲吻牵手吧
[01:08.95]我们可以去任何地方
[01:11.86]用看不见的翅膀飞向远方
[01:16.55]和你一起驱动魔法
[01:32.49]以500千米时速加速
[01:35.24]不断奔跑 滑倒 摔倒
[01:37.94]果然
[01:38.89]每天都很奇怪可笑
[01:43.38]总觉得被牵连
[01:45.40]备受折磨
[01:46.82]但一点关系也没有
[01:48.62]随你高兴 随你所想
[01:51.47]这样就会皆大欢喜
[01:55.72]日复一日 偶尔会很混乱
[02:00.95]握住我的手 没关系
[02:03.68]一起开始梦想的故事
[02:06.54]开始奔跑 现在闪耀光芒 喂
[02:11.92]初次的悸动
[02:14.34]用传递爱情的魔法 让我们坠入爱河
[02:17.69]但愿能一直持续下去
[02:22.46]叹息不合适你
[02:24.98]露出欢乐的笑脸吧
[02:27.85]让我们分享火热之情
[02:32.65]和我一起驱动魔法
[03:06.44]油然而生的冲动
[03:08.92]撼动着我的身体
[03:14.47]初次的悸动
[03:16.97]用绽放爱情的魔法 让爱在心中萌芽
[03:20.40]心跳更加厉害
[03:25.15]在夜空中亲吻牵手吧
[03:27.56]我们可以去任何地方
[03:30.63]用看不见的翅膀飞向远方
[03:35.08]和你一起驱动魔法
[03:37.87]             `,
      },
      {
        id: 19,
        name: '刻ト詩-OP Short ver',
        singers: '水谷瑠奈',
        isLove: false,
        time: '01:49',
        path: '/music/pome.mp3',
        list: [],
      },
      {
        id: 20,
        name: 'ヘタクソな恋',
        singers: '小日向千虎',
        isLove: false,
        time: '04:23',
        path: '/music/asa.mp3',
        list: [],
      },
      {
        id: 21,
        name: 'Girlish Lover',
        singers: '田村ゆかり、赤﨑千夏...',
        isLove: false,
        time: '03:56',
        path: '/music/Girlish Lover.flac',
        list: [],
        lyric: `[00:00.00]Girlish Lover - 赤崎千夏/田村由香里/金元寿子/茅野愛衣
[00:01.56]词：小田倉奈知
[00:01.96]曲：太田雅友
[00:02.52]编曲：E F F Y(FirstCall)
[00:03.07]预备齐
[00:04.07]欢迎回来(yeah)
[00:05.47]然后出门去(yeah)
[00:06.99]奔跑赶赴与你的幽会
[00:09.83]友情虽排在第一
[00:12.83]恋人更该排在第一
[00:14.62]Girlish lover
[00:21.70]这一份心痛 全部都怪你
[00:26.83]内心的那阵悸动 当说谎的言语
[00:33.12]到今天为止 固守的领域
[00:38.42]未来会变得怎样 倘若越过去
[00:44.77]呐 可否和你一起 不行？
[00:48.24]不行！只有我可以
[00:50.61]不粗心也不大意
[00:53.51]想和你超越所谓的边际
[00:59.77]再更加
[01:00.82]大胆少许(yeah)
[01:02.17]强硬少许(yeah)
[01:03.71]露出喜欢的心绪
[01:06.56]不管是温柔的你
[01:09.57]还是喜欢使坏的你
[01:11.33]全独占到底
[01:12.44]快点注意(yeah)
[01:13.73]还是要放弃(yeah)
[01:15.39]言不由衷 fall in love
[01:18.23]虽已是朋友以上
[01:21.25]却还未到恋人关系
[01:22.92]Girlish lover
[01:30.06]眼中只有你 闪耀的美丽
[01:35.32]向着你远去背影 追赶着的足迹
[01:41.56]从今天以后 探寻的路径
[01:46.82]尽可能想要传达 向着这过去
[01:53.10]要紧抱住你 死缠着你 不行？
[01:56.51]不行！真岂有此理
[01:58.93]想要撒娇 想要触及
[02:01.86]还请告诉我界限在哪里
[02:08.09]哎呀呀
[02:09.12]真是棘手(yeah)
[02:10.47]那个情敌(yeah)
[02:12.05]姑且当目标努力
[02:14.91]不管胸口的暖意
[02:17.86]还是你未来的光阴
[02:19.67]全死守到底
[02:20.77]回答问题(yeah)
[02:22.09]还是要放弃(yeah)
[02:23.66]单向通行 集和地
[02:26.58]相信着命运轨迹
[02:29.56]去将约定交换完毕
[02:31.30]Now loading lover
[02:46.90]是真心话？还是说谎？
[02:49.77]喜欢？
[02:50.39]喜欢！
[02:50.92]因为喜欢你 所以
[02:52.75]认真回答 止住笑意
[02:55.71]就这样超越暧昧的边际
[03:03.34]哎呀呀
[03:04.45]大胆少许(yeah)
[03:05.80]强硬少许(yeah)
[03:07.33]露出喜欢的心绪
[03:10.20]和你之间的爱恋
[03:13.13]将会走到什么境地
[03:14.97]快说别逃避
[03:16.12]激动不已
[03:17.32]小跑着出去(yeah)
[03:18.92]怦然心动的幽会
[03:21.84]虽已是朋友以上
[03:24.81]却还未到恋人关系
[03:26.52]Girlish lover
[03:30.64]  `,
      },
      {
        id: 22,
        name: '刹那绽放的恋之花火',
        singers: '未知',
        isLove: false,
        time: '01:33',
        path: '/music/flower.wav',
        list: [],
        video: '/movie/flower.mp4',
      },
      {
        id: 23,
        name: 'Happy Halloween',
        singers: '梱枝莉子',
        isLove: false,
        time: '04:16',
        path: '/music/Happy Halloween.wav',
        list: [],
      },
      {
        id: 24,
        name: '天选庶民的真命之选',
        singers: '未知',
        isLove: false,
        time: '01:51',
        path: '/music/tianxuan.wav',
        list: [],
        video: '/movie/tianxuan.mp4',
      },
      {
        id: 25,
        name: '恋想关系',
        singers: '未知',
        isLove: false,
        time: '01:42',
        path: '/music/love.wav',
        list: [],
        video: '/movie/love.mp4',
      },
      {
        id: 26,
        name: 'raspberry cube',
        singers: '松下',
        isLove: false,
        time: '03:34',
        path: '/music/raspberry cube.flac',
        list: [],
        video: '/movie/raspberry cube.mp4',
        lyric: `[00:00.00]松下 - raspberry cube
[00:01.69]作词：堀江晶太
[00:02.70]作曲：堀江晶太
[00:03.81]编曲：堀江晶太
[00:04.97]品尝我的爱 如此酸甜可口
[00:06.28]
[00:12.41]回响着 啪地一声
[00:13.65]睁开双眼 清晨来临
[00:15.17]直至昨天的忧郁
[00:17.03]都一笔勾销
[00:18.86]果然我还是想做原本的自己
[00:22.77]想要让你变得心跳加速
[00:25.26]胡乱地涂鸦
[00:26.80]想再次擦除爱的话语
[00:28.95]只有梦想肯定是不行的
[00:31.69]
[00:31.90]心中的胆怯与纯情正在争吵
[00:35.59]
[00:35.83]很想要对你说
[00:37.55]都是你的错
[00:38.87]我心中的秘密 快点察觉吧
[00:42.76]品尝我的爱 如此酸甜可口
[00:44.40]
[00:46.01]浆果 浆果 请不要
[00:47.53]无视这份恋情
[00:49.25]浆果 浆果 想要全部占为己有
[00:52.52]希望在你身旁一同欢笑
[00:54.11]希望能陪你走人生道路
[00:55.77]还有 还有
[00:56.62]想要与你亲吻
[00:59.25]快点 快点 就这样带我走吧
[01:02.54]晴天 晴天 向着闪耀的明天
[01:05.62]一生都想同你一起嬉戏
[01:08.95]呐 就算我是这样想的
[01:11.68]也不能告诉你
[01:13.89]好烦恼啊 啊啊
[01:16.97]
[01:21.84]紧接着 砰地一声
[01:23.01]也许我并没有
[01:25.76]想象中个性倔强
[01:28.14]
[01:28.40]终于将想法传达给你
[01:31.25]这也只不过是与你
[01:32.72]回忆的点滴而已
[01:34.89]转过身去时
[01:36.28]你说了什么吗
[01:38.36]用时光停止般的眼神注视着你
[01:41.19]
[01:41.49]告诉我吧 啊啊 等一下
[01:43.79]还是等一下吧
[01:45.22]果然还是觉得不能再等了
[01:48.33]我想要知道你心中的秘密
[01:51.96]
[01:52.23]品尝我的爱 如此酸甜可口
[01:54.00]
[01:55.56]浆果 浆果 稍微有些
[01:57.08]急不可耐了吧
[01:58.85]浆果 浆果 拜托你快点
[02:00.33]摘掉这份心情吧
[02:01.83]想要更近的与你彼此凝视
[02:03.57]想要与你更加紧密地接触
[02:05.26]想要 想要
[02:06.09]变得更加贪心
[02:08.70]快点 快点 就这样带我走吧
[02:12.04]晴天 晴天 向着闪耀的明天
[02:15.08]想要与你度过 最棒的瞬间
[02:18.51]这样的心情
[02:19.98]我一生不会忘记
[02:23.52]
[02:35.15]温柔又苦涩
[02:36.71]酸涩中也有甜蜜
[02:38.44]所以青春就是这样的味道吧
[02:41.67]我已经无可自拔地
[02:43.29]变得这样喜欢你了
[02:46.53]
[02:48.53]品尝我的爱 如此酸甜可口
[02:50.15]
[02:51.85]浆果 浆果 请不要
[02:53.37]无视这份恋情
[02:55.14]浆果 浆果 想要全部占为己有
[02:58.23]希望在你身旁一同欢笑
[03:00.00]希望能陪你走人生道路
[03:01.71]还有 还有
[03:02.32]果然还是想要亲吻呢
[03:05.13]快点 快点 就这样带我走吧
[03:08.27]晴天 晴天 无论何时都如此闪耀
[03:11.41]一生都想同你
[03:13.08]一起嬉戏下去
[03:14.87]呐 就算我是这样想的
[03:17.49]也不能告诉你 实在太过烦恼了
[03:21.24]又变得更加喜欢你了 啊啊
[03:24.42]   `,
      },
      {
        id: 27,
        name: '空气力学少女与少年之诗',
        singers: 'はな',
        isLove: false,
        time: '04:13',
        path: '/music/suqingri.mp3',
        list: [],
        lyric: `[00:00.00]空気力学少女と少年の詩 (空气力学少女与少年的诗) - はな
[00:10.80]词：すかぢ
[00:21.61]曲：szak
[00:32.42]天使的科学 空气力学
[00:36.94]站在屋顶的围栏上
[00:39.70]俯视的世界
[00:42.66]满溢着
[00:44.88]几近消散无踪的话语
[00:47.32]展翅翱翔吧
[00:48.76]现在 我将展开我的双翼飞翔
[00:57.84]
[01:14.54]神明之声 空气力学
[01:18.97]站在岌岌可危之处
[01:21.77]仰望而上的世界
[01:24.92]方才吐露而出的话语
[01:27.05]填满了整片天空
[01:29.60]倾吐出心声吧
[01:31.03]重新铸造这个世界
[01:34.75]
[01:36.60]湛蓝的天空 化为潺潺流水
[01:40.92]溺水的人们 沉溺在这世上
[01:46.35]我展开耀眼的双翼
[01:52.40]拨开眼前这片汪洋
[01:57.66]我将拼尽全力飞翔 越过这不断沉沦的世界
[02:03.86]直至到你身旁
[02:11.45]
[02:29.65]空气力学是少女的梦想 
[02:34.22]想要站在喜欢的人身边
[02:36.89]凝望着眼前一切
[02:39.90]寡言少语 就像是稀薄的空气一般
[02:44.78]但 吐露出了勇气
[02:47.82]说出了那句 我喜欢你
[02:50.36]所以 现在
[02:53.91]请让我倾听 
[03:00.31]空气力学少年少女的诗
[03:03.32]
[03:21.16]象征着再生的鱼儿们
[03:27.30]掌管着灭亡的鸟儿们
[03:32.61]我凭借着自身的空气力学翱翔着
[03:38.54]不断翱翔着
[03:42.84]现在 定能到达心之所向
[03:53.28]    `,
      },
      {
        id: 28,
        name: '起于世界的理想论',
        singers: '未知',
        isLove: false,
        time: '01:40',
        path: '/music/lixiang.flac',
        list: [],
        video: '/movie/lixiang.mp4',
      },
      {
        id: 29,
        name: 'ときめき·Chocolaterie',
        singers: 'Kyoka',
        isLove: false,
        time: '03:34',
        path: '/music/Chocolaterie.mp3',
        list: [],
        video: '/movie/Chocolaterie.mp4',
      },
      {
        id: 30,
        name: 'ときめき·Decoration',
        singers: 'Kyoka',
        isLove: false,
        time: '04:02',
        path: '/music/Decoration.mp3',
        list: [],
        video: '/movie/Decoration.mp4',
      },
      {
        id: 31,
        name: 'あまいろ＊TeaParty',
        singers: 'uniy',
        isLove: false,
        time: '04:05',
        path: '/music/TeaParty.mp3',
        list: [],
        video: '/movie/TeaParty.mp4',
      },
      {
        id: 32,
        name: '君とのミチシルベ',
        singers: '藤井稿太郎、KyoKa',
        isLove: false,
        time: '04:08',
        path: '/music/baoshi.mp3',
        list: [],
        video: '/movie/baoshi.mp4',
        lyric: `[00:00.00]
[00:15.92]它标志着我们的开始。
[00:20.82]我翻开书中的一页
[00:25.98]走出教室，走向
[00:30.98]无垠的蓝天
[00:36.42]即使跌倒，我也会尽快爬起来
[00:41.32]
[00:41.58]我是那种不会轻易放弃的人
[00:45.93]先尝试，再粉碎。
[00:49.12]这样不是很好吗？
[00:51.87]现在就是起跑线。
[00:56.43]即使有你不知道的世界
[01:00.45]我可以和你一起奔跑，即使有一条路。
[01:07.02]
[01:07.55]双手捧起梦想，我们的心将变得勇敢。
[01:16.99]没有什么不可能
[01:20.80]无论发生什么，只要有你，我们就能奔跑
[01:27.42]闪耀的故事
[01:31.93]永远闪耀的未来
[01:36.17]因为它是未来的宝石
[01:40.16]
[01:47.85]即使它现在还是一块小石头
[01:52.75]只要你擦亮它，它就会成为珍宝
[01:57.85]愿你用它的光芒包裹你所爱的人
[02:02.85]希望有一天，我也能将他们包裹在这光芒之中
[02:08.26]事实上，我什么都做不了
[02:13.12]我有一部分人放弃了
[02:17.82]我只是继续前进，挣扎着，坚持着
[02:23.63]这无尽的旅程还要持续多久？
[02:31.96]
[02:39.04]当我被自己的软弱击垮时
[02:43.79]我哀叹着，尖叫着，站都站不起来了。
[02:49.00]
[02:49.34]然而，支撑我内心的是......
[02:54.09]你在我眼睑上的微笑
[03:02.29]
[03:09.42]即使有我不知道的路
[03:13.11]只要我们有同样的信念，我们就能奔跑。
[03:19.93]因为用双手去实现我们共同的梦想的心，会变成勇气
[03:29.79]没有什么不可能
[03:33.23]无论何时，只要有你，我就能奔跑
[03:40.30]闪耀的故事
[03:44.77]永远闪耀的未来
[03:48.85]因为它是未来的宝石
[03:53.04]        `,
      },
      {
        id: 33,
        name: '永遠に咲く花',
        singers: '水城新人',
        isLove: false,
        time: '04:34',
        path: '/music/kuhua.flac',
        list: [],
        video: '/movie/kuhua.mp4',
        lyric: `[00:00.00]永遠に咲く花
[00:10.81]水城新人
[00:18.00]
[00:21.65]静静地 在梦境之中
[00:25.95]向天空 张开双手
[00:31.68]静静地 等待着
[00:35.61]背对着 被风吹动的未来
[00:41.81]记忆 从手中飘落
[00:46.16]淡淡的悲伤 消失不见
[00:51.83]阳光渗入微闭的双眼
[00:55.85]孤独地
[00:57.63]汇集着声音的碎片
[01:02.47]摇摆不定 虚幻的未来
[01:07.36]迫不及待 轮回流转
[01:10.25]流着泪
[01:12.13]向远方的天空虔诚祈祷
[01:18.61]不要枯萎 绽放于心的白色的风
[01:25.41]仰望温柔的天空
[01:30.32]向悲伤道别
[01:35.02]希望的光辉 你的祈祷之声
[01:40.53]细数着 绽放的花朵
[01:55.21]等到精疲力尽 捂住双耳
[01:59.68]在阳光中 花瓣飘落
[02:05.14]回首曾视而不见的往昔
[02:09.00]那冷彻心扉的
[02:11.93]孤独的夜晚
[02:15.69]闪烁着 星与月的光辉
[02:20.28]历历在目 消失不见
[02:23.17]怀抱着遥远梦境的
[02:25.43]碎片入眠的日日夜夜
[02:31.84]不要消失
[02:33.07]在渴望的风中残留的声音
[02:38.80]与背过脸去的笑容
[02:43.35]无依无靠的双手
[02:48.24]能够实现的答案
[02:50.70]传达到这双手的奇迹
[02:55.91]
[03:12.32]从那一天起
[03:15.93]怀抱在手中的白色翅膀
[03:19.08]如今 也如白雪一般
[03:23.76]不变的约定
[03:28.62]十指紧扣 那一天的答案
[03:33.48]留在手中的你的声音
[03:39.47]不断轮回的 绝不枯萎的花朵
[03:44.96]传达给终焉的世界吧
[03:48.64]希望的羁绊
[03:51.14]乘着风
[03:54.50]架起彩虹的桥
[03:58.12]让光芒 在此刻绽放
[04:18.90]    `,
      },
    ])
    const getModeList = (SongDefaultList: Array<Song>, mode: string) => {
      if (mode === '/default') {
        // 默认歌单
        return SongDefaultList
      } else if (mode === '/love') {
        const result: Array<Song> = []
        for (let i = 0; i < SongDefaultList.length; i++) {
          if (SongDefaultList[i].isLove) {
            // 我喜欢
            result.push(SongDefaultList[i])
          }
        }
        return result
      } else {
        // 自定义歌单
        const result: Array<Song> = []
        for (let i = 0; i < SongDefaultList.length; i++) {
          if (SongDefaultList[i].list) {
            for (let j = 0; j < SongDefaultList[i].list.length; j++) {
              if (`/list${SongDefaultList[i].list[j]}` === mode) {
                result.push(SongDefaultList[i])
              }
            }
          }
        }
        return result
      }
    }
    const changeLoveState = (id: number) => {
      for (let i = 0; i < SongDefaultList.value.length; i++) {
        if (SongDefaultList.value[i].id === id) {
          SongDefaultList.value[i].isLove = !SongDefaultList.value[i].isLove
          return
        }
      }
    }
    return { SongDefaultList, songList, getModeList, changeLoveState }
  },
  {
    persist: false, // 默认为关
  },
)
